[
  {
    "title": "TV Pal",
    "tags": ["React", "Redux", "Sass", "Node.js", "Express", "MongoDB"],
    "demo": "https://tv-pal-2020.herokuapp.com/",
    "code": "https://github.com/sh-k-l/tvpal",
    "description": "A full stack MERN application to manage your favourite TV shows. A centralised place to see when new episodes are out, instead of having to look through every platform. Check off episodes as you watch them. Rank your TV shows into a rankings list and share the list with others.",
    "image": "tv-pal.png"
  },
  {
    "title": "Our Borough",
    "tags": ["JavaScript", "jQuery", "ArcGIS JS API"],
    "demo": "https://mapsat.tmbc.gov.uk/maps/ourborough/",
    "description": "Designed and developed while working at TMBC. A centralised point for users to enter their address and find information about nearby facilities, ranging from council buildings to recycling sites, car parks and nurseries in the borough. Uses cookies to save application state. Autoplots home address for registered users. Uses the ArcGIS JS API.",
    "image": "ourborough.png"
  },
  {
    "title": "CineManager",
    "tags": ["C#", ".NET Core", "WPF", "ASP.NET"],
    "code": "https://github.com/sh-k-l/cinemanager",
    "description": "A learning application produced while learning C# .NET during lockdown 2020. I used/am using this project to learn techniques and principles such as MVVM, dependency injection and SOLID."
  },
  {
    "title": "Onion or not?",
    "tags": ["JavaScript", "React"],
    "code": "https://github.com/sh-k-l/onion-or-not",
    "demo": "https://sh-k-l.github.io/onion-or-not/",
    "description": "Simple game. Gets two headlines from Reddit, one real and one fake. Pick the real one. How many can you get in a row?",
    "image": "onion-or-not.png"
  },
  {
    "title": "EasyNotes",
    "tags": ["C#", ".NET Core", "WPF"],
    "code": "https://github.com/sh-k-l/EasyNotes",
    "description": "A simple notes application that autosaves notes to text files. I was tired of using notepad/notepad++ so wrote my own basic solution for what I wanted: a basic application similar to the default notes app on my phone. Also a chance to refamilarise myself with a strongly typed and object orientated language.",
    "image": "easy-notes.png"
  },
  {
    "title": "Portfolio",
    "tags": ["JavaScript", "React", "Sass"],
    "code": "https://github.com/sh-k-l/portfolio",
    "description": "Personal portfolio built with React and styled with Sass.",
    "image": "portfolio.png"
  }
]